In [10]:
import pandas as pd
from numpy import nan as NA

data= pd.DataFrame([[1.0,6.5,5.4],[1.0,NA,NA],[NA,NA,NA],[NA,6.5,3.3]], columns = list("abc"))
display(data)
print()
print(" dropna With How= ALL")
cleaned= data.dropna(how="all")
print(cleaned)
print()
print(" dropna Without How= ALL")
cleaned= data.dropna()
print(cleaned)

print()
print("dropna with axis 1 means columns wise: ")
cleaned= data.dropna(axis=1, how="all")
print(cleaned)

     a    b    c
0  1.0  6.5  5.4
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.3

 dropna With How= ALL
     a    b    c
0  1.0  6.5  5.4
1  1.0  NaN  NaN
3  NaN  6.5  3.3

 dropna Without How= ALL
     a    b    c
0  1.0  6.5  5.4

dropna with axis 1 means columns wise:
     a    b    c
0  1.0  6.5  5.4
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.3

# Filling Data

In [24]:
import numpy as np
df= pd.DataFrame(np.random.randn(7,3))

df.iloc[:4,1]=NA
df.iloc[:2,2]=NA


# display(df)


#df= df.fillna(1.5)

#print(df)

#df= df.fillna({1: 0.5, 2: 3.4})
#print(df)
df= df.fillna(method="ffill", axis=1)
display(df)
df= df.fillna(method="ffill", limit = 1, axis=1)
df

          0         1         2
0 -1.279683 -1.279683 -1.279683
1 -0.316692 -0.316692 -0.316692
2  1.215804  1.215804 -0.246026
3 -0.627680 -0.627680  1.976722
4 -1.156826  0.870462 -0.326955
5  0.094446  0.933556 -0.807795
6 -1.544138 -0.505708 -0.234762

          0         1         2
0 -1.279683 -1.279683 -1.279683
1 -0.316692 -0.316692 -0.316692
2  1.215804  1.215804 -0.246026
3 -0.627680 -0.627680  1.976722
4 -1.156826  0.870462 -0.326955
5  0.094446  0.933556 -0.807795
6 -1.544138 -0.505708 -0.234762

# Removing Duplicates

In [31]:
import pandas as pd

data= pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                   'k2': [1,1,2,3,3,4,4]})
#display(data)
#data.duplicated()
#data.drop_duplicates()
data['v1']= ['one', 'two', 'one', 'four', 'one', 'six', 'two']
display(data)
data= data.drop_duplicates(['k1','v1'])
data

    k1  k2    v1
0  one   1   one
1  two   1   two
2  one   2   one
3  two   3  four
4  one   3   one
5  two   4   six
6  two   4   two

    k1  k2    v1
0  one   1   one
1  two   1   two
3  two   3  four
5  two   4   six

# Replacing Vaölues

In [36]:
import numpy as np
import pandas as pd


df= pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=np.nan
df.iloc[:2,2]=np.nan


df= df.replace(np.nan, -121)

df=df.replace(-121,231)
df

          0           1           2
0  1.336593  231.000000  231.000000
1  0.007797  231.000000  231.000000
2  0.731812  231.000000   -1.881594
3  1.044479  231.000000   -0.455708
4 -0.960634    0.941483    1.312528
5 -0.115594    0.335212   -0.739203
6 -0.296594   -0.604929    0.776156

# Rename Index

In [42]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
        index=['Ohio', 'Colorado', 'New York'],
        columns=['one', 'two', 'three', 'four'])

#display(data)
transform = lambda x: x[:4].upper()
data.index = data.index.map(transform)
display(data)

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

# ### Detecting and Filtering Outliers

In [43]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()
col = data[2]
#print(col)
#col[np.abs(col) > 3]
#To select all rows having a value exceeding 3 or –3, 
#you can use the 'any' method on a boolean DataFrame:
#any method will check all cells 
outliers = data[(np.abs(data) > 3).any(1)]
print(len(outliers), len(data))
outliers
# check the difference
#print(data)
#data[(np.abs(data) > 3)]

9 1000

            0         1         2         3
287 -3.068024  1.499061  0.447769  0.117861
381  1.490726 -3.983363  1.934137  0.390823
509 -0.055251 -1.018757  3.276464 -1.031194
533 -3.066110  1.200841  0.702299 -0.447295
647  0.704877  1.048938  3.039326 -0.712174
729  0.453278 -3.166279 -0.067745  0.364487
818  0.549982 -3.195238 -0.751754 -0.092458
832  0.567609 -3.237690 -0.850531  1.272447
913  3.638635 -1.278692  0.978218 -0.138631

# Permutation and Random Sampling

In [44]:
# Permuting (randomly reordering)
# a Series or the rows in a DataFrame
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
#print( df.shape )
sampler = np.random.permutation(4)
print(sampler)
#df = df[sampler]
display(df)
df.take(sampler)

[1 0 2 3]

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15

# Regular Expressions

In [45]:
#When you call re.split('\s+', text) , the regular expression is first compiled, and
#then its split method is called on the passed text. You can compile the regex yourself
#with re.compile , forming a reusable regex object:

In [46]:
import re
text = "foo    bar\t baz \tqux"
#normal split = text.split()
#re.split('\s+', text) # spliting based on whitespaces
#text.split(" ")
#['foo', 'bar', 'baz', 'qux']
# compile once to use again and again and save time
rgx = re.compile('\s+')
rgx.split(text)

['foo', 'bar', 'baz', 'qux']

# Vectorized String Functions in pandas

In [47]:
import re
import pandas as pd
import numpy as np
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = ["simpleEmail@email.com",   "simple.email@email.com",  
        "plus+symbol@email.com",   "dash-symbol@email.com",  
     "q@email.com",   
    "“unusual”@email.com",   "dash-symbol@email-dash.com",   "test@emailServer",  
  "” “@email.com",   "user@[IPv6:2001:DB8::1]",   
  "example@localhost",   "example@s.solutions",   
  "12345@email.com"]   

data = pd.Series(data)
display(data)
pattern = '([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'
#data.str.findall(pattern, flags=re.IGNORECASE)
matches = data[data.str.match(pattern, flags=re.IGNORECASE)]
matches

0          simpleEmail@email.com
1         simple.email@email.com
2          plus+symbol@email.com
3          dash-symbol@email.com
4                    q@email.com
5            “unusual”@email.com
6     dash-symbol@email-dash.com
7               test@emailServer
8                  ” “@email.com
9        user@[IPv6:2001:DB8::1]
10             example@localhost
11           example@s.solutions
12               12345@email.com
dtype: object

0          simpleEmail@email.com
1         simple.email@email.com
2          plus+symbol@email.com
3          dash-symbol@email.com
4                    q@email.com
6     dash-symbol@email-dash.com
11           example@s.solutions
12               12345@email.com
dtype: object

In [48]:
import pandas as pd
import numpy as np
data = pd.Series(np.random.randn(10),
        index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd', 'a'],
        [1, 2, 3, 1, 3, 1, 2, 2, 3,1] ] )
display(data)
#hierarchically indexed object partial indexing is possible

a  1   -0.495253
   2   -1.165208
   3    2.664070
b  1   -0.577816
   3   -0.164559
c  1   -0.788252
   2    1.626952
d  2   -1.065793
   3    0.718495
a  1   -1.841153
dtype: float64

In [52]:
#Hierarchical indexing plays an important role in reshaping data and group-based
#operations like forming a pivot table. For example, 
#you could rearrange the data into
#a DataFrame using its unstack method:
df =  data.unstack() 
display(df)
df.stack()

ValueError: Index contains duplicate entries, cannot reshape

In [50]:
data.loc[['b', 'd']]

b  1   -0.577816
   3   -0.164559
d  2   -1.065793
   3    0.718495
dtype: float64

In [51]:
data.loc[:, 2]

a   -1.165208
c    1.626952
d   -1.065793
dtype: float64

In [53]:
#With a DataFrame, either axis can have a hierarchical index
# [18]
import pandas as pd
import numpy as np
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
        index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
        columns=[['Ohio', 'Ohio', 'Colorado'],
        ['Green', 'Red', 'Green']])
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
display(frame)
#frame['Ohio']

#Be careful to distinguish the index names 'state' and 'color'
#from the row labels

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [55]:
#@@  Reordering and sorting Levels
frame.swaplevel('key1', 'key2')
#can save in the same frame variables 
# or another variables like
frame = frame.swaplevel('key1', 'key2')

In [58]:
#sort_index , on the other hand, sorts the data using only the values in a single level.
#When swapping levels, it’s not uncommon to also use sort_index so that the result is
#lexicographically sorted by the indicated level:
frame.sort_index(level=1)
# compare the above statement output with following statement output
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11